Repository: minhducnt/ZenS_Assignment
Catalog: mobile/joke_app/lib/app/global/localization/l10n/intl_*.arb
Languages: vi

# noInternetConnection
source: No internet connection. Please try again later.
vi: Không có kết nối Internet. Vui lòng thử lại sau

source: Something went wrong
vi: Đã xảy ra lỗi

# somethingWentWrongAgain
source: Something went wrong!! Please try again.
vi: Đã xảy ra lỗi!! Vui lòng thử lại

# server_failure
source: Server failure encountered.
vi: Đã gặp sự cố máy chủ

# communication_error
source: There was an error with our communication with the servers.
vi: Đã xảy ra lỗi trong quá trình giao tiếp với các máy chủ

source: Unauthenticated error
vi: Không xác thực được

source: Cancel
vi: Hủy

# loadingText
source: Loading...
vi: Đang tải...

# like
source: This is Funny!
vi: Điều này thật buồn cười!

# dislike
source: This is not Funny!
vi: Điều này không buồn cười!

# thatsAllFolks
source: That's all the jokes for today! Come back another day!
vi: Đó là tất cả những câu chuyện cười cho hôm nay! Hãy quay lại vào ngày khác!
